##    Pandas

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
user_data = {
    "marksA": np.random.randint(1 , 100, 5),
    "marksB" : np.random.randint(5 , 100, 5),
      "marksC" :  np.random.randint(1 , 100, 5)
}
df = pd.DataFrame(user_data)

In [5]:
print (df)

   marksA  marksB  marksC
0       5      87      34
1       9      38      20
2      42      62      73
3      92      83      34
4      24      61      84

In [6]:
df.head(n = 3)

   marksA  marksB  marksC
0       5      87      34
1       9      38      20
2      42      62      73

In [7]:
df.columns

Index(['marksA', 'marksB', 'marksC'], dtype='object')

In [9]:
df.to_csv("masks.csv")

In [11]:
my_data = pd.read_csv("masks.csv")

In [13]:
my_data

   Unnamed: 0  marksA  marksB  marksC
0           0       5      87      34
1           1       9      38      20
2           2      42      62      73
3           3      92      83      34
4           4      24      61      84

In [18]:
my_data.describe()

       Unnamed: 0     marksA     marksB     marksC
count    5.000000   5.000000   5.000000   5.000000
mean     2.000000  34.400000  66.200000  49.000000
std      1.581139  35.331289  19.715476  27.802878
min      0.000000   5.000000  38.000000  20.000000
25%      1.000000   9.000000  61.000000  34.000000
50%      2.000000  24.000000  62.000000  34.000000
75%      3.000000  42.000000  83.000000  73.000000
max      4.000000  92.000000  87.000000  84.000000

In [21]:
df.iloc[3]

marksA    92
marksB    83
marksC    34
Name: 3, dtype: int64

In [22]:
df.iloc[3,1]

83

In [23]:
df.iloc[3][1]

83

In [26]:
idx = df.columns.get_loc("marksB")

In [28]:
df.iloc[3,idx]

83

### Sort ther data frame

In [29]:
my_data.sort_values(by=["marksA"] , ascending=True)

   Unnamed: 0  marksA  marksB  marksC
0           0       5      87      34
1           1       9      38      20
4           4      24      61      84
2           2      42      62      73
3           3      92      83      34

In [30]:
my_data.sort_values(by=["marksA"] , ascending= False)

   Unnamed: 0  marksA  marksB  marksC
3           3      92      83      34
2           2      42      62      73
4           4      24      61      84
1           1       9      38      20
0           0       5      87      34

In [31]:
my_data.sort_values(by=["marksA" , "marksC"] , ascending=True)

   Unnamed: 0  marksA  marksB  marksC
0           0       5      87      34
1           1       9      38      20
4           4      24      61      84
2           2      42      62      73
3           3      92      83      34

### data frame to NUMPY

In [33]:
data_array = my_data.values

In [34]:
data_array

array([[ 0,  5, 87, 34],
       [ 1,  9, 38, 20],
       [ 2, 42, 62, 73],
       [ 3, 92, 83, 34],
       [ 4, 24, 61, 84]])

In [36]:
data_array.shape

(5, 4)

### numpy to data frame

In [39]:
new_df = pd.DataFrame(data_array , dtype="int32" , columns=["No of Student ","Physics " , "Chemistry" , "Math"])

In [40]:
new_df.head()

   No of Student   Physics   Chemistry  Math
0               0         5         87    34
1               1         9         38    20
2               2        42         62    73
3               3        92         83    34
4               4        24         61    84